SOA Applications/SOA_App_01/Financial_Application/testsuites/UnitTests/tests/MyApplicationBpelProcessInputAndOutputCheck.xml

<?xml version="1.0" encoding="UTF-8" ?>
<!-- Generated by Oracle SCA Test Modeler version 1.0 at [2014/11/07 8:15 AM]. -->
<compositeTest compositeDN="Financial_Application" xmlns="http://xmlns.oracle.com/sca/2006/test">
  <about/>
  <initiate serviceName="myapplication_client_ep" operation="process" isAsync="false" delay="PT0S">
    <message>
      <part partName="payload">
        <content>
          <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
            <soap:Body>
              <ns1:customer xmlns:ns1="http://www.example.org">
                <ns1:FirstNames>soumya</ns1:FirstNames>
                <ns1:LastName>pattanaik</ns1:LastName>
                <ns1:Gender>male</ns1:Gender>
                <ns1:DOB>1991-12-12</ns1:DOB>
                <ns1:IdNum>7179164</ns1:IdNum>
                <ns1:Email>spattanaik75@gmail.com</ns1:Email>
                <ns1:CellNum>0749210674</ns1:CellNum>
                <ns1:AddressLine1>home</ns1:AddressLine1>
                <ns1:AddressLine2>home</ns1:AddressLine2>
                <ns1:AddressLine3>home</ns1:AddressLine3>
                <ns1:AddressLine4>home</ns1:AddressLine4>
                <ns1:AreaCode>2169</ns1:AreaCode>
                <ns1:BankName>standard bank</ns1:BankName>
                <ns1:AccountHolderName>s r pattanaik</ns1:AccountHolderName>
                <ns1:AccountNumber>0147852369</ns1:AccountNumber>
                <ns1:AccountTypeId>1</ns1:AccountTypeId>
                <ns1:BranchCode>2169</ns1:BranchCode>
                <ns1:DateChanged>2012-12-12</ns1:DateChanged>
                <ns1:PaymentTypeId>1</ns1:PaymentTypeId>
                <ns1:PaymentFreq>12</ns1:PaymentFreq>
                <ns1:PaymentMethodId>1</ns1:PaymentMethodId>
                <ns1:IsFixedInterestRate>1</ns1:IsFixedInterestRate>
                <ns1:PurchasePrice>30000</ns1:PurchasePrice>
                <ns1:Deposit>3500</ns1:Deposit>
                <ns1:nettIncome>90000</ns1:nettIncome>
                <ns1:totalMonthlyExpenses>200</ns1:totalMonthlyExpenses>
                <ns1:totalMonthlyCredit>200</ns1:totalMonthlyCredit>
                <ns1:ExtrasTotal>200</ns1:ExtrasTotal>
                <ns1:Terms>24</ns1:Terms>
                <ns1:BalloonPercentage>1</ns1:BalloonPercentage>
                <ns1:AdminFees>200</ns1:AdminFees>
                <ns1:DealerAmt>200</ns1:DealerAmt>
                <ns1:CategoryId>1</ns1:CategoryId>
                <ns1:IsNewCar>1</ns1:IsNewCar>
                <ns1:MakeDesc>1</ns1:MakeDesc>
                <ns1:ModelName>S205</ns1:ModelName>
                <ns1:KmTravelled>50000</ns1:KmTravelled>
              </ns1:customer>
            </soap:Body>
          </soap:Envelope>
        </content>
      </part>
    </message>
  </initiate>
  <wireActions wireSource="myapplication_client_ep" operation="process">
    <assert comparisonMethod="xml-similar">
      <expected>
        <location key="input"/>
        <message>
          <part partName="payload">
            <content>
              <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
                <soap:Body>
                  <ns1:customer xmlns:ns1="http://www.example.org">
                    <ns1:FirstNames>soumya</ns1:FirstNames>
                    <ns1:LastName>pattanaik</ns1:LastName>
                    <ns1:Gender>male</ns1:Gender>
                    <ns1:DOB>1991-12-12</ns1:DOB>
                    <ns1:IdNum>7179164</ns1:IdNum>
                    <ns1:Email>spattanaik75@gmail.com</ns1:Email>
                    <ns1:CellNum>0749210674</ns1:CellNum>
                    <ns1:AddressLine1>home</ns1:AddressLine1>
                    <ns1:AddressLine2>home</ns1:AddressLine2>
                    <ns1:AddressLine3>home</ns1:AddressLine3>
                    <ns1:AddressLine4>home</ns1:AddressLine4>
                    <ns1:AreaCode>2169</ns1:AreaCode>
                    <ns1:BankName>standard bank</ns1:BankName>
                    <ns1:AccountHolderName>s r pattanaik</ns1:AccountHolderName>
                    <ns1:AccountNumber>0147852369</ns1:AccountNumber>
                    <ns1:AccountTypeId>1</ns1:AccountTypeId>
                    <ns1:BranchCode>2169</ns1:BranchCode>
                    <ns1:DateChanged>2012-12-12</ns1:DateChanged>
                    <ns1:PaymentTypeId>1</ns1:PaymentTypeId>
                    <ns1:PaymentFreq>12</ns1:PaymentFreq>
                    <ns1:PaymentMethodId>1</ns1:PaymentMethodId>
                    <ns1:IsFixedInterestRate>1</ns1:IsFixedInterestRate>
                    <ns1:PurchasePrice>30000</ns1:PurchasePrice>
                    <ns1:Deposit>3500</ns1:Deposit>
                    <ns1:nettIncome>90000</ns1:nettIncome>
                    <ns1:totalMonthlyExpenses>200</ns1:totalMonthlyExpenses>
                    <ns1:totalMonthlyCredit>200</ns1:totalMonthlyCredit>
                    <ns1:ExtrasTotal>200</ns1:ExtrasTotal>
                    <ns1:Terms>24</ns1:Terms>
                    <ns1:BalloonPercentage>1</ns1:BalloonPercentage>
                    <ns1:AdminFees>200</ns1:AdminFees>
                    <ns1:DealerAmt>200</ns1:DealerAmt>
                    <ns1:CategoryId>1</ns1:CategoryId>
                    <ns1:IsNewCar>1</ns1:IsNewCar>
                    <ns1:MakeDesc>1</ns1:MakeDesc>
                    <ns1:ModelName>S205</ns1:ModelName>
                    <ns1:KmTravelled>50000</ns1:KmTravelled>
                  </ns1:customer>
                </soap:Body>
              </soap:Envelope>
            </content>
          </part>
        </message>
      </expected>
    </assert>
    <assert comparisonMethod="xml-similar">
      <expected>
        <location key="output"/>
        <message>
          <part partName="payload">
            <content>
              <ApplicationStatus xmlns="http://www.example.org">
                <status>Application Submitted.</status>
              </ApplicationStatus>
            </content>
          </part>
        </message>
      </expected>
    </assert>
    <emulate duration="PT0S">
      <message>
        <part partName="payload">
          <content>
            <ApplicationStatus xmlns="http://www.example.org">
              <status>Application Submitted.</status>
            </ApplicationStatus>
          </content>
        </part>
      </message>
    </emulate>
  </wireActions>
</compositeTest>
